app/controllers/items_controller.rb

INSERT INTO "items" ("name", "created_at", "updated_at") VALUES (?, ?, ?)  [["name", "Purple Rain"], ["created_at", "2021-04-01 03:30:22.712725"], ["updated_at", "2021-04-01 03:30:22.712725"]]
---
    def create
        @item = Item.create!(params.permit(:name))